Merge branch 'docs-graphviz-to-maeremaid' of lkiesow/opencast into r/11.x
Pull request #3990
  Remove Graphviz from Documentation
